/**
 * 1. Вивести на сторінку в один рядок через кому числа від 10 до 20.
 */
document.write("<br>--------------------- № 1 ---------------------<br><br>");
for (let i = 10; i <= 20; i++) {
	i == 20 ? document.write(i) : document.write(i + ", ");
}

document.write("<br><br>-------------------- № 2 --------------------<br><br>");

/**
 * 2. Вивести квадрати чисел від 10 до 20.
 */
for (let i = 10; i <= 20; i++) {
	i == 20 ? document.write(i ** 2) : document.write(i ** 2 + ", ");
}

document.write("<br><br>-------------------- № 3 --------------------<br><br>");

/**
 * 3. Вивести таблицю множення на 7.
 */
for (let i = 1; i <= 10; i++) {
	document.write(7 + " x " + i + " = " + 7 * i + "<br>");
}

document.write("<br><br>-------------------- № 4 --------------------<br><br>");

/**
 * 4. Знайти суму всіх цілих чисел від 1 до 15.
 */
let n4_sum = 0;

for (let i = 1; i < 15; i++) {
	if (i % 2 == 0) {
		n4_sum += i;
	}
}
document.write("Сума всіх цілих чисел = " + n4_sum);

document.write("<br><br>-------------------- № 5 --------------------<br><br>");

/**
 * 5. Знайти добуток усіх цілих чисел від 15 до 35.
 */
let n5_sum = 1;

for (let i = 15; i < 35; i++) {
	if (i % 2 == 0) {
		n5_sum *= i;
	}
}
document.write("Добуток всіх цілих чисел = " + n5_sum);

document.write("<br><br>-------------------- № 6 --------------------<br><br>");

/**
 * 6. Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
 */
let n6_sum = 0;
let n6_count = 0;

for (let i = 1; i < 500; i++) {
	if (i % 2 == 0) {
		n6_sum += i;
		n6_count++;
	}
}
document.write("Середнє арифметичне всіх цілих чисел = " + n6_sum / n6_count);

document.write("<br><br>-------------------- № 7 --------------------<br><br>");

/**
 * 7. Вивести суму лише парних чисел в діапазоні від 30 до 80.
 */
let n7_sum = 0;

for (let i = 30; i < 80; i++) {
	if (i % 2 == 0) {
		n7_sum += i;
	}
}
document.write("Сума всіх парних чисел = " + n7_sum);

document.write("<br><br>-------------------- № 8 --------------------<br><br>");

/**
 * 8. Вивести всі числа в діапазоні від 100 до 200 кратні 3.
 */
for (let i = 100; i < 200; i++) {
	if (i % 3 == 0) {
		document.write(i + " ");
	}
}

document.write("<br><br>-------------------- № 9 --------------------<br><br>");

/**
 * 9. Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
 */
let n7 = 12;

document.write("Дільники числа " + n7 + ": ");
for (let i = 1; i < n7; i++) {
	if (n7 % i == 0) {
		document.write(i + " ");
	}
}

document.write(
	"<br><br>-------------------- № 10 --------------------<br><br>"
);

/**
 * 10. Визначити кількість його парних дільників.
 */
document.write("Кількість парних дільників числа " + n7 + ": ");
for (let i = 1; i < n7; i++) {
	if (n7 % i == 0) {
		if (i % 2 == 0) {
			document.write(i + " ");
		}
	}
}

document.write(
	"<br><br>-------------------- № 11 --------------------<br><br>"
);

/**
 * 11. Знайти суму його парних дільників.
 */
let n11_sum = 0;

for (let i = 1; i < n7; i++) {
	if (n7 % i == 0) {
		if (i % 2 == 0) {
			n11_sum += i;
		}
	}
}
document.write("Сума парних дільників числа " + n7 + ": " + n11_sum);

document.write(
	"<br><br>-------------------- № 12 --------------------<br><br>"
);

/**
 * 12. Надрукувати повну таблицю множення від 1 до 10.
 */
for (let i = 1; i <= 10; i++) {
	for (let j = 1; j <= 10; j++) {
		document.write(i + " x " + j + " = " + i * j + "<br>");
	}
	document.write("<br>");
}

document.write(
	"<br><br>-------------------- № 13 --------------------<br><br>"
);

/**
 * 13. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
 */
for (let i = 20; i < 30; i += 0.5) {
	document.write(i + " ");
}

document.write(
	"<br><br>-------------------- № 14 --------------------<br><br>"
);

/**
 * 14. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
 */
let dollarRate = 27;

for (let i = 10; i <= 100; i += 10) {
	document.write(i + " доларів - " + dollarRate * i + " гривень <br>");
}

document.write(
	"<br><br>-------------------- № 15 --------------------<br><br>"
);

/**
 * 15. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
 */
let n15_number = 200;

for (let i = 1; i < 100; i++) {
	if (i ** 2 < n15_number) {
		document.write(i + " ");
	}
}

document.write(
	"<br><br>-------------------- № 16 --------------------<br><br>"
);

/**
 * 16. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
 */
let n16_number = 7;

for (let i = 2; i < n16_number; i++) {
	if (n16_number % i == 0) {
		document.write("Число " + n16_number + " НЕ Є простим");
		break;
	} else {
		document.write("Число " + n16_number + " Є простим");
		break;
	}
}

document.write(
	"<br><br>-------------------- № 17 --------------------<br><br>"
);
/**
 * 17. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
 */
let n17_number = 27;

while (n17_number % 3 == 0) {
	n17_number /= 3;
}

document.write(
	n17_number == 1 ? "Число можна отримати " : "Число неможна отримати"
);
